app/controllers/sessions_controller.rb

  def create
    account = Account.from_omniauth(env['omniauth.auth'])
    account.create_user && account.save! if account.user.nil?
---
INSERT INTO "accounts" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-06 08:36:25.399806"], ["name", "parasquid"], ["provider", "facebook"], ["uid", "10152921269877922"], ["updated_at", "2014-12-06 08:36:25.399806"]]
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-12-06 09:19:25.013295"], ["updated_at", "2014-12-06 09:19:25.013295"]]
UPDATE "accounts" SET "updated_at" = ?, "user_id" = ? WHERE "accounts"."id" = 1  [["updated_at", "2014-12-06 14:54:46.351835"], ["user_id", 2]]